{
  "Developer": "Developer",
  "Scroll": "Scroll",
  "Down": "Down",
  "Send a message": "Send a message",

  "About me": "About Me",
  "Hey, I'm Florian based near Stuttgart, Germany. With a background in mechanical engineering, I've transitioned to front-end web development. Thanks to my combined expertise in engineering and programming, I can help you to turn your concepts into efficient and user-friendly web solutions.": "Hey, I'm Florian based near Stuttgart, Germany. With a background in mechanical engineering, I've transitioned to front-end web development. Thanks to my combined expertise in engineering and programming, I can help you to turn your concepts into efficient and user-friendly web solutions.",
  "Feel free to contact me for your next development needs.": "Feel free to contact me for your next development needs.",
  "Let's talk": "Let's talk",

  "My Skills": "My Skills",

  "Feel free to explore my recent projects and check out their source code.": "Feel free to explore my recent projects and check out their source code.",
  "projectDescriptionJoin": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
  "projectDescriptionSharkie": "A simple Jump-and-Run game based on an object-oriented approach. Help sharkie to find coins and poison bottles to fight against the killer whale.",

  "Say Hi!": "Say Hi!",
  "Have a project in mind?": "Have a project in mind?",
  "I'd love to hear about it. Contact me, and let's make it happen together!": "I'd love to hear about it. Contact me, and let's make it happen together!",
  "Your name*": "Your name*",
  "Your name is required": "Your name is required",
  "Please enter a valid name": "Please enter a valid name",
  "Your email*": "Your email*",
  "Your email is required": "Your email is required",
  "Please enter a valid email": "Please enter a valid email",
  "Your message*": "Your message*",
  "A message is required": "A message is required",

  "I've read the": "I've read the",
  "privacy policy": "privacy policy",
  "and agree to the processing of my data as outlined.": "and agree to the processing of my data as outlined.",
  "Send message": "Send message",
  "submit feedback": "Thank you! Your message has been sent successfully. I will get back to you    soon.",

  "Legal Notice": "Legal Notice",
  "Email copied to clipboard!": "Email copied to clipboard!",
  "Privacy Policy": "Privacy Policy",

  "Imprint_H1": "Information pursuant to Sect. 5 German Telemedia Act (TMG)",
  "Imprint_H2": "Contact",
  "Phone:": "Phone:",

  "PP_Title": "Privacy Policy",

  "PP_Section1_H2": "1. An overview of data protection",
  "PP_Section1_H3_01": "General information",
  "PP_Section1_P_01": "The following information will provide you with an easy to navigate overview of what will happen with your personal data when you visit this website. The term “personal data” comprises all data that can be used to personally identify you. For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy.",
  "PP_Section1_H3_02": "Data recording on this website",
  "PP_Section1_H4_01": "Who is the responsible party for the recording of data on this website (i.e., the “controller”)?",
  "PP_Section1_P_02": "The data on this website is processed by the operator of the website, whose contact information is available under section “Information about the responsible party (referred to as the “controller” in the GDPR)” in this Privacy Policy.",
  "PP_Section1_H4_02": "How do we record your data?",
  "PP_Section1_P_03": "We collect your data as a result of your sharing of your data with us. This may, for instance be information you enter into our contact form.",
  "PP_Section1_P_04": "Other data shall be recorded by our IT systems automatically or after you consent to its recording during your website visit. This data comprises primarily technical information (e.g., web browser, operating system, or time the site was accessed). This information is recorded automatically when you access this website.",
  "PP_Section1_H4_03": "What are the purposes we use your data for?",
  "PP_Section1_P_05": "A portion of the information is generated to guarantee the error free provision of the website. Other data may be used to analyze your user patterns.",
  "PP_Section1_H4_04": "What rights do you have as far as your information is concerned?",
  "PP_Section1_P_06": "You have the right to receive information about the source, recipients, and purposes of your archived personal data at any time without having to pay a fee for such disclosures. You also have the right to demand that your data are rectified or eradicated. If you have consented to data processing, you have the option to revoke this consent at any time, which shall affect all future data processing. Moreover, you have the right to demand that the processing of your data be restricted under certain circumstances. Furthermore, you have the right to log a complaint with the competent supervising agency.",
  "PP_Section1_P_07": "Please do not hesitate to contact us at any time if you have questions about this or any other data protection related issues.",

  "PP_Section2_H2": "2. Hosting",
  "PP_Section2_P_01": "We are hosting the content of our website at the following provider:",
  "PP_Section2_H3_01": "All-Inkl",
  "PP_Section2_P_02": "The Provider is the ALL-INKL.COM – Neue Medien Münnich, owner: René Münnich, Hauptstraße 68, 02742 Friedersdorf, Germany (hereinafter “All-Inkl”). For details, please visit the privacy policy of All-Inkl:",
  "PP_Section2_A_01": "https://all-inkl.com/datenschutzinformationen/",
  "PP_Section2_P_03": "The use of All-Inkl is based on Art. 6(1)(f) GDPR. We have a legitimate interest in the most reliable representation of our website. If appropriate consent has been obtained, the processing is carried out exclusively on the basis of Art. 6(1)(a) GDPR and § 25 (1) TTDSG, insofar the consent includes the storage of cookies or the access to information in the user’s end device (e.g., device fingerprinting) within the meaning of the TTDSG. This consent can be revoked at any time.",

  "PP_Section3_H2": "3. General information and mandatory information",
  "PP_Section3_H3_01": "Data protection",
  "PP_Section3_P_01": "The operators of this website and its pages take the protection of your personal data very seriously. Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration.",
  "PP_Section3_P_02": "Whenever you use this website, a variety of personal information will be collected. Personal data comprises data that can be used to personally identify you. This Data Protection Declaration explains which data we collect as well as the purposes we use this data for. It also explains how, and for which purpose the information is collected.",
  "PP_Section3_P_03": "We herewith advise you that the transmission of data via the Internet (i.e., through e-mail communications) may be prone to security gaps. It is not possible to completely protect data against third-party access.",
  "PP_Section3_H3_02": "Information about the responsible party (referred to as the “controller” in the GDPR)",
  "PP_Section3_P_04": "The data processing controller on this website is:",
  "PP_Section3_P_05": "Phone:",
  "PP_Section3_P_06": "E-mail:",
  "PP_Section3_P_07": "The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g., names, e-mail addresses, etc.).",
  "PP_Section3_H3_03": "Storage duration",
  "PP_Section3_P_08": "Unless a more specific storage period has been specified in this privacy policy, your personal data will remain with us until the purpose for which it was collected no longer applies. If you assert a justified request for deletion or revoke your consent to data processing, your data will be deleted, unless we have other legally permissible reasons for storing your personal data (e.g., tax or commercial law retention periods); in the latter case, the deletion will take place after these reasons cease to apply.",
  "PP_Section3_H3_04": "General information on the legal basis for the data processing on this website",
  "PP_Section3_P_09": "If you have consented to data processing, we process your personal data on the basis of Art. 6(1)(a) GDPR or Art. 9 (2)(a) GDPR, if special categories of data are processed according to Art. 9 (1) DSGVO. In the case of explicit consent to the transfer of personal data to third countries, the data processing is also based on Art. 49 (1)(a) GDPR. If you have consented to the storage of cookies or to the access to information in your end device (e.g., via device fingerprinting), the data processing is additionally based on § 25 (1) TTDSG. The consent can be revoked at any time. If your data is required for the fulfillment of a contract or for the implementation of pre-contractual measures, we process your data on the basis of Art. 6(1)(b) GDPR. Furthermore, if your data is required for the fulfillment of a legal obligation, we process it on the basis of Art. 6(1)(c) GDPR. Furthermore, the data processing may be carried out on the basis of our legitimate interest according to Art. 6(1)(f) GDPR. Information on the relevant legal basis in each individual case is provided in the following paragraphs of this privacy policy.",
  "PP_Section3_H3_05": "Recipients of personal data",
  "PP_Section3_P_10": "In the scope of our business activities, we cooperate with various external parties. In some cases, this also requires the transfer of personal data to these external parties. We only disclose personal data to external parties if this is required as part of the fulfillment of a contract, if we are legally obligated to do so (e.g., disclosure of data to tax authorities), if we have a legitimate interest in the disclosure pursuant to Art. 6 (1)(f) GDPR, or if another legal basis permits the disclosure of this data. When using processors, we only disclose personal data of our customers on the basis of a valid contract on data processing. In the case of joint processing, a joint processing agreement is concluded.",
  "PP_Section3_H3_06": "Revocation of your consent to the processing of data",
  "PP_Section3_P_11": "A wide range of data processing transactions are possible only subject to your express consent. You can also revoke at any time any consent you have already given us. This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.",
  "PP_Section3_H3_07": "Right to object to the collection of data in special cases; right to object to direct advertising (Art. 21 GDPR)",
  "PP_Section3_P_12": "IN THE EVENT THAT DATA ARE PROCESSED ON THE BASIS OF ART. 6(1)(E) OR (F) GDPR, YOU HAVE THE RIGHT TO AT ANY TIME OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA BASED ON GROUNDS ARISING FROM YOUR UNIQUE SITUATION. THIS ALSO APPLIES TO ANY PROFILING BASED ON THESE PROVISIONS. TO DETERMINE THE LEGAL BASIS, ON WHICH ANY PROCESSING OF DATA IS BASED, PLEASE CONSULT THIS DATA PROTECTION DECLARATION. IF YOU LOG AN OBJECTION, WE WILL NO LONGER PROCESS YOUR AFFECTED PERSONAL DATA, UNLESS WE ARE IN A POSITION TO PRESENT COMPELLING PROTECTION WORTHY GROUNDS FOR THE PROCESSING OF YOUR DATA, THAT OUTWEIGH YOUR INTERESTS, RIGHTS AND FREEDOMS OR IF THE PURPOSE OF THE PROCESSING IS THE CLAIMING, EXERCISING OR DEFENCE OF LEGAL ENTITLEMENTS (OBJECTION PURSUANT TO ART. 21(1) GDPR).",
  "PP_Section3_P_13": "IF YOUR PERSONAL DATA IS BEING PROCESSED IN ORDER TO ENGAGE IN DIRECT ADVERTISING, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR AFFECTED PERSONAL DATA FOR THE PURPOSES OF SUCH ADVERTISING AT ANY TIME. THIS ALSO APPLIES TO PROFILING TO THE EXTENT THAT IT IS AFFILIATED WITH SUCH DIRECT ADVERTISING. IF YOU OBJECT, YOUR PERSONAL DATA WILL SUBSEQUENTLY NO LONGER BE USED FOR DIRECT ADVERTISING PURPOSES (OBJECTION PURSUANT TO ART. 21(2) GDPR).",
  "PP_Section3_H3_08": "Right to log a complaint with the competent supervisory agency",
  "PP_Section3_P_14": "In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred. The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses.",
  "PP_Section3_H3_09": "Right to data portability",
  "PP_Section3_P_15": "You have the right to have data that we process automatically on the basis of your consent or in fulfillment of a contract handed over to you or to a third party in a common, machine-readable format. If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible.",
  "PP_Section3_H3_10": "Information about, rectification and eradication of data",
  "PP_Section3_P_16": "Within the scope of the applicable statutory provisions, you have the right to demand information about your archived personal data, their source and recipients as well as the purpose of the processing of your data at any time. You may also have a right to have your data rectified or eradicated. If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time.",
  "PP_Section3_H3_11": "Right to demand processing restrictions",
  "PP_Section3_P_17": "You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned. To do so, you may contact us at any time. The right to demand restriction of processing applies in the following cases:",
  "PP_Section3_Li_01": "In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim. During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data.",
  "PP_Section3_Li_02": "If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data instead of demanding the eradication of this data.",
  "PP_Section3_Li_03": "If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication.",
  "PP_Section3_Li_04": "If you have raised an objection pursuant to Art. 21(1) GDPR, your rights and our rights will have to be weighed against each other. As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data.",
  "PP_Section3_P_18": "If you have restricted the processing of your personal data, these data – with the exception of their archiving – may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU.",
  "PP_Section3_H3_12": "SSL and/or TLS encryption",
  "PP_Section3_P_19": "For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program. You can recognize an encrypted connection by checking whether the address line of the browser switches from “http://” to “https://” and also by the appearance of the lock icon in the browser line.",
  "PP_Section3_P_20": "If the SSL or TLS encryption is activated, data you transmit to us cannot be read by third parties.",

  "PP_Section4_H2": "4. Recording of data on this website",
  "PP_Section4_H3_01": "Cookies",
  "PP_Section4_P_01": "Our websites and pages use what the industry refers to as “cookies.” Cookies are small data packages that do not cause any damage to your device. They are either stored temporarily for the duration of a session (session cookies) or they are permanently archived on your device (permanent cookies). Session cookies are automatically deleted once you terminate your visit. Permanent cookies remain archived on your device until you actively delete them, or they are automatically eradicated by your web browser.",
  "PP_Section4_P_02": "Cookies can be issued by us (first-party cookies) or by third-party companies (so-called third-party cookies). Third-party cookies enable the integration of certain services of third-party companies into websites (e.g., cookies for handling payment services).",
  "PP_Section4_P_03": "Cookies have a variety of functions. Many cookies are technically essential since certain website functions would not work in the absence of these cookies (e.g., the shopping cart function or the display of videos). Other cookies may be used to analyze user behavior or for promotional purposes.",
  "PP_Section4_P_04": "Cookies, which are required for the performance of electronic communication transactions, for the provision of certain functions you want to use (e.g., for the shopping cart function) or those that are necessary for the optimization (required cookies) of the website (e.g., cookies that provide measurable insights into the web audience), shall be stored on the basis of Art. 6(1)(f) GDPR, unless a different legal basis is cited. The operator of the website has a legitimate interest in the storage of required cookies to ensure the technically error-free and optimized provision of the operator’s services. If your consent to the storage of the cookies and similar recognition technologies has been requested, the processing occurs exclusively on the basis of the consent obtained (Art. 6(1)(a) GDPR and § 25 (1) TTDSG); this consent may be revoked at any time.",
  "PP_Section4_P_05": "You have the option to set up your browser in such a manner that you will be notified any time cookies are placed and to permit the acceptance of cookies only in specific cases. You may also exclude the acceptance of cookies in certain cases or in general or activate the delete-function for the automatic eradication of cookies when the browser closes. If cookies are deactivated, the functions of this website may be limited.",
  "PP_Section4_P_06": "Which cookies and services are used on this website can be found in this privacy policy.",
  "PP_Section4_H3_02": "Consent with Cookiebot",
  "PP_Section4_P_07": "Our website uses consent technology from Cookiebot to obtain your consent to the storage of certain cookies on your end device or for the use of certain technologies and to document this in a data protection-compliant manner. The provider of this technology is Cybot A/S, Havnegade 39, 1058 Copenhagen, Denmark (hereinafter “Cookiebot”).",
  "PP_Section4_P_08": "When you enter our website, a connection is established with the Cookiebot servers to obtain your consent and provide you with other explanations regarding the use of cookies. Cookiebot will then store a cookie in your browser to identify the consent you have given or its revocation. The data collected in this way is stored until you request us to delete it, delete the Cookiebot cookie itself or the purpose for which the data is stored no longer applies. Mandatory legal storage obligations remain unaffected.",
  "PP_Section4_P_09": "Cookiebot is used to obtain the legally required consent for the use of cookies. The legal basis for this is Art. 6(1)(c) GDPR.",
  "PP_Section4_H3_03": "Contact form",
  "PP_Section4_P_10": "If you submit inquiries to us via our contact form, the information provided in the contact form as well as any contact information provided therein will be stored by us in order to handle your inquiry and in the event that we have further questions. We will not share this information without your consent.",
  "PP_Section4_P_11": "The processing of these data is based on Art. 6(1)(b) GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures. In all other cases the processing is based on our legitimate interest in the effective processing of the requests addressed to us (Art. 6(1)(f) GDPR) or on your agreement (Art. 6(1)(a) GDPR) if this has been requested; the consent can be revoked at any time.",
  "PP_Section4_P_12": "The information you have entered into the contact form shall remain with us until you ask us to eradicate the data, revoke your consent to the archiving of data or if the purpose for which the information is being archived no longer exists (e.g., after we have concluded our response to your inquiry). This shall be without prejudice to any mandatory legal provisions, in particular retention periods.",
  "PP_Section4_H3_04": "Request by e-mail, telephone, or fax",
  "PP_Section4_P_13": "If you contact us by e-mail, telephone or fax, your request, including all resulting personal data (name, request) will be stored and processed by us for the purpose of processing your request. We do not pass these data on without your consent.",
  "PP_Section4_P_14": "These data are processed on the basis of Art. 6(1)(b) GDPR if your inquiry is related to the fulfillment of a contract or is required for the performance of pre-contractual measures. In all other cases, the data are processed on the basis of our legitimate interest in the effective handling of inquiries submitted to us (Art. 6(1)(f) GDPR) or on the basis of your consent (Art. 6(1)(a) GDPR) if it has been obtained; the consent can be revoked at any time.",
  "PP_Section4_P_15": "The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g. after completion of your request). Mandatory statutory provisions - in particular statutory retention periods - remain unaffected.",

  "PP_Section5_H2": "5. Plug-ins and Tools",
  "PP_Section5_H3_01": "Google Fonts (local embedding)",
  "PP_Section5_P_01": "This website uses so-called Google Fonts provided by Google to ensure the uniform use of fonts on this site. These Google fonts are locally installed so that a connection to Google’s servers will not be established in conjunction with this application.",
  "PP_Section5_P_02": "For more information on Google Fonts, please follow this link:",
  "PP_Section5_A_01": "https://developers.google.com/fonts/faq",
  "PP_Section5_P_03": "and consult Google’s Data Privacy Declaration under:",
  "PP_Section5_A_02": "https://policies.google.com/privacy?hl=en"
}
